Revit 2024 API
CompoundStructure.IsCoreLayer Method
 Checks if the specified layer is a core layer.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool IsCoreLayer(
	int layerIdx
)
Visual Basic
Public Function IsCoreLayer ( _
	layerIdx As Integer _
) As Boolean
Visual C++
public:
bool IsCoreLayer(
	int layerIdx
)
Parameters
layerIdx
Type: System.Int32
 The index of a layer in this CompoundStructure.
Return Value
 Returns true if the layer is within the core layer boundary, false if it is in the interior or exterior shell layers.
Remarks
 You can change the shell/core layer boundary using SetNumberOfShellLayers(ShellLayerType, Int32).
See Also
CompoundStructure Class
Autodesk.Revit.DB Namespace